outputs/sysbench_metrics.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 10
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 10 tps: 15.90 qps: 333.74 (r/w/o: 234.76/66.19/32.79) lat (ms,99%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 14.00 qps: 280.72 (r/w/o: 196.12/56.60/28.00) lat (ms,99%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 14.70 qps: 296.00 (r/w/o: 207.40/59.20/29.40) lat (ms,99%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 14.70 qps: 289.00 (r/w/o: 202.40/57.20/29.40) lat (ms,99%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 12.40 qps: 253.50 (r/w/o: 177.10/51.60/24.80) lat (ms,99%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 13.20 qps: 254.90 (r/w/o: 178.90/49.60/26.40) lat (ms,99%): 1771.29 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            12026
        write:                           3436
        other:                           1718
        total:                           17180
    transactions:                        859    (13.88 per sec.)
    queries:                             17180  (277.56 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          61.8963s
    total number of events:              859

Latency (ms):
         min:                                   61.49
         avg:                                  716.58
         max:                                 2843.21
         99th percentile:                     2362.72
         sum:                               615541.03

Threads fairness:
    events (avg/stddev):           85.9000/2.02
    execution time (avg/stddev):   61.5541/0.60